
Функция ПолучитьНаборКлючейПолучить(Запрос)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ОткрытыйКлюч КАК ОткрытыйКлюч
	|ИЗ
	|	Справочник.Волт_Настройка КАК т
	|ГДЕ
	|	т.Ссылка = ЗНАЧЕНИЕ(Справочник.Волт_Настройка.Волт)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ОткрытыйКлюч) Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type","application/json");
		Ответ.УстановитьТелоИзСтроки(Выборка.ОткрытыйКлюч);
	Иначе
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Ошибка получения открытого ключа");
	КонецЕсли;
	Возврат Ответ;
КонецФункции
